Tekla Open API Reference for Tekla Structures 2025
Shell.GetFaceEnumerator Method
 Returns a new face enumerator in the current plane.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FaceEnumerator GetFaceEnumerator()
Public Function GetFaceEnumerator As FaceEnumerator
Return Value
Type: FaceEnumerator
A face enumerator to enumerate through shell's faces.
See Also
Reference
Shell Class
Tekla.Structures.Solid Namespace